class PlantData {
  static Map<String, Map<String, String>> info = {
    "N_Deficiency": {
      "title": "ขาดไนโตรเจน (N)",
      "solution": "เติมปุ๋ยยูเรีย (46-0-0) หรือปุ๋ยคอก เพื่อเร่งการเจริญเติบโตของใบ",
    },
    "P_Deficiency": {
      "title": "ขาดฟอสฟอรัส (P)",
      "solution": "เติมปุ๋ยสูตรที่มีตัวเลขกลางสูง เช่น 16-20-0 เพื่อบำรุงรากและดอก",
    },
    "K_Deficiency": {
      "title": "ขาดโพแทสเซียม (K)",
      "solution": "เติมปุ๋ย 0-0-60 หรือขี้เถ้าแกลบ เพื่อเพิ่มความแข็งแรงและคุณภาพผลผลิต",
    },
    "Healthy": {
      "title": "พืชสุขภาพดี",
      "solution": "รักษาความชื้นและใส่ปุ๋ยบำรุงตามระยะเวลาปกติ",
    }
  };
}